In [1]:
import pandas as pd

In [3]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [5]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [7]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [9]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [15]:
pd.merge(employees,departments,on = "DeptID") #Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [17]:
pd.merge(employees,departments,on = "DeptID", how = "left") # left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [19]:
pd.merge(employees,departments,on = "DeptID", how = "right") # Ringht join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [21]:
pd.merge(employees,departments,on = "DeptID", how = "outer") # Outer join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [23]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [25]:
pd.concat([df1,df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [27]:
pd.concat([df1,df2],axis = 1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [29]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"Score" : [90,80]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "age":[15,17]})

In [33]:
pd.concat([df1,df2])

      Name  Score   age
0    Alice   90.0   NaN
1      Bob   80.0   NaN
0  Charlie    NaN  15.0
1    David    NaN  17.0

In [35]:
pd.concat([df1,df2],axis = 1)

    Name  Score     Name  age
0  Alice     90  Charlie   15
1    Bob     80    David   17